src/DataProcessors/ПечатьНакладной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ПечатьНакладной</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Documents/ПоступлениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенаСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенаСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенаСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПродажаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ПродажаТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.ОприходованиеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПродажиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенаСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенаСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенаСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/ПечатьНакладной/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Формирует табличный документ из общего макета УниверсальнаяНакладная и заполняет данными накладной.
// В роли накладной может выступать документ Поступление товаров и Продажа товаров.
//
// Параметры:
//  Документ - ДокументСсылка.ПоступлениеТоваров/ПродажаТоваров - ссылка печатаемого документа. 
// 
// Возвращаемое значение:
//   - ТабличныйДокумент
//
&НаСервере
Функция ПечатьУниверсальнаяНакладная(Документ) Экспорт
	
	Макет 				= ПолучитьМакет("УниверсальнаяНакладная");
	ТабличныйДокумент 	= Новый ТабличныйДокумент;
	ТипЗнчНакладной 	= ТипЗнч(Документ);
	
	Если ТипЗнчНакладной = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		ИмяНакладной 		= НСтр("ru = 'Документ.ПоступлениеТоваров'");
	    СинонимНакладной 	= НСтр("ru = 'Приходная накладная'");
		ШаблонИнфОбУслуге	= НСтр("ru = 'Покупатель: ""%1""'");
	ИначеЕсли ТипЗнчНакладной = Тип("ДокументСсылка.ПродажаТоваров") Тогда
		ИмяНакладной 		= НСтр("ru = 'Документ.ПродажаТоваров'");
	    СинонимНакладной 	= НСтр("ru = 'Расходная накладная'"); 
		ШаблонИнфОбУслуге	= НСтр("ru = 'Продавец: ""%1""'");
	КонецЕсли;
	
	// Получение данных накладной.
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	""&СинонимНакладной"" КАК СинонимНакладной,
		|	Накладная.Номер КАК Номер,
		|	Накладная.Дата КАК Дата,
		|	Накладная.Склад КАК Склад,
		|	Накладная.СуммаДокумента КАК СуммаДокумента,
		|	&Автор КАК Автор,
		|	Накладная.Товары.(
		|		НомерСтроки КАК НомерСтроки,
		|		Товар КАК Товар,
		|		Цена КАК Цена,
		|		Количество КАК Количество,
		|		Сумма КАК Сумма
		|	) КАК Товары
		|ИЗ
		|	&Накладная КАК Накладная
		|ГДЕ
		|	Накладная.Ссылка В(&Ссылка)";
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СинонимНакладной", СинонимНакладной);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Накладная", ИмяНакладной);
	
	ФИОДляПечати = ПерсональныеНастройкиСервер.ЗначениеФИОДляПечати();
	ФИОДляПечати = ?(ПустаяСтрока(ФИОДляПечати), "Накладная.Автор", СтрШаблон("""%1""", ФИОДляПечати));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Автор", ФИОДляПечати);	
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= ТекстЗапроса;		
	Запрос.Параметры.Вставить("Ссылка", Документ);
	
	Результат 	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();

	// Получение областей табличного документа.
	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаСклад	= Макет.ПолучитьОбласть("ШапкаСклад");
	ОбластьТоварыШапка 	= Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары 		= Макет.ПолучитьОбласть("Товары");
	ОбластьПодвал 		= Макет.ПолучитьОбласть("Подвал");

	// Заполнение табличного документа данными накладной.
	Если Выборка.Следующий() Тогда
		// Заголовок.
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);

		// Шапка.
		НаименованиеОрганизации	= Константы.НаименованиеОрганизации.Получить();
		ОбластьШапка.Параметры.ИнфОбУслуге 	= СтрШаблон(ШаблонИнфОбУслуге, НаименованиеОрганизации);
		ТабличныйДокумент.Вывести(ОбластьШапка);

		// Склад в шапке.
		Если ПолучитьФункциональнуюОпцию("ВестиУчетПоСкладам") Тогда
			ОбластьШапкаСклад.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Вывести(ОбластьШапкаСклад);
		КонецЕсли;
		
		// Товары (ТоварыШапка и Товары).
		ТабличныйДокумент.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабличныйДокумент.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;

		// Подвал.
		ОбластьПодвал.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти
